app/controllers/organizations_controller.rb

  def index
    @organizations = Organization.all
---
SELECT `organizations`.* FROM `organizations`

  def create
    @organization = Organization.new(organization_params)

    respond_to do |format|
      if @organization.save
---
INSERT INTO `organizations` (`name`, `public_name`, `pricing_policy`, `created_at`, `updated_at`) VALUES ('nandi', 'Nandi Toyota', 'F', '2016-01-17 07:38:00', '2016-01-17 07:38:00')

  def update
    respond_to do |format|
      if @organization.update(organization_params)
---
UPDATE `organizations` SET `pricing_policy` = 'Fixed', `updated_at` = '2016-01-17 07:39:40' WHERE `organizations`.`id` = 1

    def set_organization
      @organization = Organization.find(params[:id])
---
SELECT  `organizations`.* FROM `organizations` WHERE `organizations`.`id` = 1 LIMIT 1